# any() and all()

##  ----  Quick Summary ----

---
### (titanic.sex == "male").any()
### (titanic.sex == "male").all()
### (titanic.age == 80).any()
---

# PART1: "titanic" DATASET

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv("titanic.csv")

In [3]:
titanic.head(10)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN
5         0       3    male   NaN      0      0   8.4583        Q  NaN
6         0       1    male  54.0      0      0  51.8625        S    E
7         0       3    male   2.0      3      1  21.0750        S  NaN
8         1       3  female  27.0      0      2  11.1333        S  NaN
9         1       2  female  14.0      1      0  30.0708        C  NaN

In [4]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'deck'],
      dtype='object')

# Is there any "male" person? Answer is: True

# (titanic.sex == "male").any()

In [7]:
(titanic.sex == "male").any()

True

# Are all persons "male"? Answer is: False

# (titanic.sex == "male").any()

In [10]:
(titanic.sex == "male").all()

False

There are also females.

# Is there any person Who is 80 years old? Answer is: True

In [11]:
(titanic.age == 80).any()

True

In [13]:
titanic[titanic.age == 80]

     survived  pclass   sex   age  sibsp  parch  fare embarked deck
630         1       1  male  80.0      0      0  30.0        S    A

In [16]:
pd.Series([1,0.5,1,0.1,0]).any()

True

In [17]:
titanic.fare.all()

False